nxp-appcodehub/dm-smart-sensing-inhaler/smart_sensing_inhaler/smart_sensing_inhaler_fmstr_project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPI2C1_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPI2C1_InitPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t LPI2C1_SDA = {/* Internal pull-up resistor is enabled */
                                          (uint16_t)kPORT_PullUp,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPI2C1_SDA */
                                          (uint16_t)kPORT_MuxAlt4,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is configured as LPI2C1_SDA */
    PORT_SetPinConfig(LPI2C1_INITPINS_LPI2C1_SDA_PORT, LPI2C1_INITPINS_LPI2C1_SDA_PIN, &LPI2C1_SDA);

    const port_pin_config_t LPI2C1_SCL = {/* Internal pull-up resistor is enabled */
                                          (uint16_t)kPORT_PullUp,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPI2C1_SCL */
                                          (uint16_t)kPORT_MuxAlt4,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB5 (pin 3) is configured as LPI2C1_SCL */
    PORT_SetPinConfig(LPI2C1_INITPINS_LPI2C1_SCL_PORT, LPI2C1_INITPINS_LPI2C1_SCL_PIN, &LPI2C1_SCL);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPI2C1_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '2', peripheral: n/a, signal: disabled, pin_signal: PTB4/WUU0_P15/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/TRGMUX0_IN0/FLEXIO0_D30, pull_select: down,
    pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
  - {pin_num: '3', peripheral: n/a, signal: disabled, pin_signal: PTB5/LPSPI1_PCS2/LPUART1_RTS_b/LPI2C1_SCL/I3C0_SCL/TRGMUX0_OUT0/FLEXIO0_D31, pull_select: down,
    pull_enable: disable, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPI2C1_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPI2C1_DeinitPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t portb4_pin2_config = {/* Internal pull-up/down resistor is disabled */
                                                  (uint16_t)kPORT_PullDisable,
                                                  /* Low internal pull resistor value is selected. */
                                                  (uint16_t)kPORT_LowPullResistor,
                                                  /* Fast slew rate is configured */
                                                  (uint16_t)kPORT_FastSlewRate,
                                                  /* Passive input filter is disabled */
                                                  (uint16_t)kPORT_PassiveFilterDisable,
                                                  /* Open drain output is disabled */
                                                  (uint16_t)kPORT_OpenDrainDisable,
                                                  /* Low drive strength is configured */
                                                  (uint16_t)kPORT_LowDriveStrength,
                                                  /* Normal drive strength is configured */
                                                  (uint16_t)kPORT_NormalDriveStrength,
                                                  /* Pin is disabled */
                                                  (uint16_t)kPORT_PinDisabledOrAnalog,
                                                  /* Pin Control Register fields [15:0] are not locked */
                                                  (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is disabled */
    PORT_SetPinConfig(PORTB, 4U, &portb4_pin2_config);

