nxp-appcodehub/dm-smart-sensing-inhaler/smart_sensing_inhaler/smart_sensing_inhaler_fmstr_project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI1_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI1_InitPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t LPSPI1_PCS0 = {/* Internal pull-up resistor is enabled */
                                           (uint16_t)kPORT_PullUp,
                                           /* Low internal pull resistor value is selected. */
                                           (uint16_t)kPORT_LowPullResistor,
                                           /* Fast slew rate is configured */
                                           (uint16_t)kPORT_FastSlewRate,
                                           /* Passive input filter is disabled */
                                           (uint16_t)kPORT_PassiveFilterDisable,
                                           /* Open drain output is disabled */
                                           (uint16_t)kPORT_OpenDrainDisable,
                                           /* High drive strength is configured */
                                           (uint16_t)kPORT_HighDriveStrength,
                                           /* Normal drive strength is configured */
                                           (uint16_t)kPORT_NormalDriveStrength,
                                           /* Pin is configured as LPSPI1_PCS0 */
                                           (uint16_t)kPORT_MuxAlt2,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinConfig(LPSPI1_INITPINS_LPSPI1_PCS0_PORT, LPSPI1_INITPINS_LPSPI1_PCS0_PIN, &LPSPI1_PCS0);

    const port_pin_config_t LPSPI1_IN = {/* Internal pull-up resistor is enabled */
                                         (uint16_t)kPORT_PullUp,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* High drive strength is configured */
                                         (uint16_t)kPORT_HighDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SIN */
                                         (uint16_t)kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(LPSPI1_INITPINS_LPSPI1_IN_PORT, LPSPI1_INITPINS_LPSPI1_IN_PIN, &LPSPI1_IN);

    const port_pin_config_t LPSPI1_SCK = {/* Internal pull-up resistor is enabled */
                                          (uint16_t)kPORT_PullUp,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* High drive strength is configured */
                                          (uint16_t)kPORT_HighDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPSPI1_SCK */
                                          (uint16_t)kPORT_MuxAlt2,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(LPSPI1_INITPINS_LPSPI1_SCK_PORT, LPSPI1_INITPINS_LPSPI1_SCK_PIN, &LPSPI1_SCK);

    const port_pin_config_t LPSPI1_OUT = {/* Internal pull-up resistor is enabled */
                                          (uint16_t)kPORT_PullUp,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* High drive strength is configured */
                                          (uint16_t)kPORT_HighDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPSPI1_SOUT */
                                          (uint16_t)kPORT_MuxAlt2,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(LPSPI1_INITPINS_LPSPI1_OUT_PORT, LPSPI1_INITPINS_LPSPI1_OUT_PIN, &LPSPI1_OUT);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPSPI0_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: ADC0, signal: 'A, 12', pin_signal: ADC0_A12/PTA16/RF_NOT_ALLOWED/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/TPM0_CH4/LPUART0_RX/RF_GPO_8/FLEXIO0_D5,
    pull_select: down, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '12', peripheral: ADC0, signal: 'A, 13', pin_signal: ADC0_A13/PTA17/WUU0_P3/RF_NOT_ALLOWED/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/TPM0_CH5/LPUART0_TX/RF_GPO_7/RF_GPO_8/FLEXIO0_D6,
    pull_select: down, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '13', peripheral: LPCMP1, signal: 'IN, 1', pin_signal: CMP1_IN1/PTA18/LPSPI0_SOUT/LPUART0_CTS_b/LPI2C0_SDA/TPM0_CH3/RF_GPO_0/LPUART0_RX, pull_select: down,
    pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
  - {pin_num: '14', peripheral: LPCMP1, signal: 'IN, 0', pin_signal: CMP1_IN0/PTA19/WUU0_P4/LPSPI0_SCK/LPUART0_RTS_b/LPI2C0_SCL/TPM0_CH2/RF_GPO_1, pull_select: down,
    pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

