nxp-appcodehub/dm-smart-sensing-inhaler/smart_sensing_inhaler/smart_sensing_inhaler_fmstr_project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI1_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI1_DeinitPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t LPSPI1_PCS0 = {/* Internal pull-up/down resistor is disabled */
                                           (uint16_t)kPORT_PullDisable,
                                           /* Low internal pull resistor value is selected. */
                                           (uint16_t)kPORT_LowPullResistor,
                                           /* Fast slew rate is configured */
                                           (uint16_t)kPORT_FastSlewRate,
                                           /* Passive input filter is disabled */
                                           (uint16_t)kPORT_PassiveFilterDisable,
                                           /* Open drain output is disabled */
                                           (uint16_t)kPORT_OpenDrainDisable,
                                           /* Low drive strength is configured */
                                           (uint16_t)kPORT_LowDriveStrength,
                                           /* Normal drive strength is configured */
                                           (uint16_t)kPORT_NormalDriveStrength,
                                           /* Pin is configured as ADC0_B10 */
                                           (uint16_t)kPORT_PinDisabledOrAnalog,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as ADC0_B10 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_LPSPI1_PCS0_PORT, LPSPI1_DEINITPINS_LPSPI1_PCS0_PIN, &LPSPI1_PCS0);

    const port_pin_config_t LPSPI1_IN = {/* Internal pull-up/down resistor is disabled */
                                         (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as ADC0_B11 */
                                         (uint16_t)kPORT_PinDisabledOrAnalog,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as ADC0_B11 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_LPSPI1_IN_PORT, LPSPI1_DEINITPINS_LPSPI1_IN_PIN, &LPSPI1_IN);

    const port_pin_config_t LPSPI1_SCK = {/* Internal pull-up/down resistor is disabled */
                                          (uint16_t)kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as ADC0_B12 */
                                          (uint16_t)kPORT_PinDisabledOrAnalog,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as ADC0_B12 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_LPSPI1_SCK_PORT, LPSPI1_DEINITPINS_LPSPI1_SCK_PIN, &LPSPI1_SCK);

    const port_pin_config_t LPSPI1_OUT = {/* Internal pull-up/down resistor is disabled */
                                          (uint16_t)kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as ADC0_B13 */
                                          (uint16_t)kPORT_PinDisabledOrAnalog,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as ADC0_B13 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_LPSPI1_OUT_PORT, LPSPI1_DEINITPINS_LPSPI1_OUT_PIN, &LPSPI1_OUT);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPUART1_InitPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART1, signal: RX, pin_signal: PTC2/WUU0_P9/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM1_CH2/I3C0_PUR/FLEXIO0_D18, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '40', peripheral: LPUART1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM1_CH3/FLEXIO0_D19, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

